Repository: jouissancetka/LMW
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 这小子似乎打定主意要跟他交朋友，两老也没反对，虽然很可能和凌霄有关，但他说话倒是直来直往。
en_us: This kid seemed to be dead set on making friends with him and the two elders didn't have any objections, though it might've been because of Ling Xiao, but he spoke as bluntly as ever.

source: 这就是传说中的猿粪！
en_us: This was what you call ape shit!

source: 这就是实力带来的好处，别人怕得罪老板娘的丈夫所以不敢开成衣店，而且老板娘是个很小心眼的人，她不许别人开成衣店跟她抢生意，所幸她卖的衣服价格还可以。
en_us: This was the advantage of strength. Others were afraid to offend the husband of the lady boss, so they did dare not open a garment shop. Moreover, the lady boss was a very petty person. She did not allow others to open a garment shop to compete for business with her. The only silver lining was that the prices of the clothes she sold were not too expensive.

source: 这就是平常好吃懒做的结果，游小默一瞬间竟然还能想到这些，他都有些佩服自己了。
en_us: This is the result of usually being gluttonous and lazy. You XiaoMo had some admiration for himself for even being able to think of these at this moment.

source: 这就是所谓的自掘坟墓！
en_us: This was what they called 'digging one's own grave'!

source: 这就是重力屋的效果，每天在这里锻炼的话，确实可增加身体和灵魂的强度。
en_us: This was the effect of the Gravity Room. If you trained here every day, you could improve your body and soul.

source: 这已经是笑阁被毁掉的第九张会议桌。
en_us: This was already the ninth meeting table he had destroyed.

source: 这幅表情，这幅语气……
en_us: This expression, this tone...

source: 这座小岛一直在他管辖的领域范围内，之所以一直攻不下就是因为这个原因。
en_us: This was the reason why he had always been unable to attack and obtain the small island, which was in the scope of his territory.

source: 这张丹方是他从所有彩级一品丹方中挑选出来比较简单的，就算别人看到也不会怀疑这是远古的丹方。
en_us: This pill recipe was a relatively simple one amongst the first grade rainbow level pill recipes he had. Even if others saw it, they wouldn't suspect it was an ancient pill recipe.

source: 这张玉床能坚持这么久肯定不是凡品，就这么毁了委实可怜。
en_us: This jade bed was definitely not an ordinary item for it to withstand the flames for so long. It was really such a pity for it to just be destroyed like this.

source: 这才刚开打，莫雪就落于下风。
en_us: They had just started fighting, and Mo Xue was already at a disadvantage.

source: 这批灵草只是进入高潮前的开胃菜。
en_us: These herbs were only the appetizer before the apex.

source: 这时一直缓慢旋转的漩涡突然疾速的旋转起来，速度越来越快，光芒仿佛齿轮与地面摩擦迸发出一道道火花。
en_us: Now, the once slowly spinning whirlpool suddenly quickened, becoming faster and faster, with sparks as if a cog was hitting the floor. (光芒仿佛齿轮与地面摩擦迸发出一道道火花)

source: 这时，一位接待员装扮的女侍朝他们走了过来，微微一笑，“三位贵客可是有邀请卡？”
en_us: That was when a a female attendant walked towards them, smiling softly. "Do you three gentleman have an invitation?"

source: 这时，人群中突然走出一个白发苍苍，手拄拐杖的佝偻老人，由于年岁已高，他的眼皮耷拉着，眼睛只能睁开一条缝，不过村民们看他的眼神却都很尊敬。
en_us: That was when a white haired old man hobbled out with his walking stick, back hunched. He was so old that his eyelids seemed to sag and he could only open his eyes by a sliver, but the villagers all looked at him with respect.

source: 这时，他们还不知道外面已经闹得沸沸扬扬了，而且游小默和凌霄还是事件的主角。
en_us: At that moment, they didn't know that it was already becoming extremely rowdy outside, and that You XiaoMo and Ling Xiao were actually the center of attention.

source: 这时，他隔壁一位长老突然发出一声轻笑。
en_us: At this moment, the elder next to him let out a light laugh.

source: 这时，以慢性子著称的玄明突然慢悠悠地开口道：“麟昊武，我劝你还是不要与他斗嘴比较好，你的口才没有他好，除非你的脸皮能与他厚。”
en_us: At this moment, Xuan Huan, who was famous for his phlegmatic temperament (慢性子) suddenly opened his mouth and unhurriedly said, "Lin HaoWu, let me advise you. Don't bicker with him unless you are as thick-skinned as him since you've already lost in eloquence."

source: 这时，在他们下方，靠门右侧的角落突然钻出一个人告诉了他们答案，那是一个穿白衣的少年，长得白白净净，跑进开酒楼后就朝凌霄扑过去，一把抱住他的腰，露出一脸傻笑。
en_us: At that moment, a person suddenly slipped out from the corner to the right of the door, telling them the answer. It was a youth wearing all white, pale and clean. After he ran into the inn, he threw himself at Ling Xiao, hugging his waist, revealing a dumb smile on his face.

source: 这时，旁边的房间也走出一个人，正是男子的同伴王华，他闻到空气中残留的香味，忍不住惊叹道：“好香的味道啊！
en_us: Right at this moment, someone walked out from another room and that someone was the other man's comrade, Wang Hua. His nose caught the lingering scent of food in the air and couldn't help but exclaim, "Something smells really good! If I recall, the food we ate yesterday afternoon also had this smell."

source: 这时，游小默往后退了两步，凌霄替到他的位置上，刚好在强者甲的对面，说到他的身份，还真不需要对他手下留情，因为此人正是古玛部落的人。
en_us: It was then when You XiaoMo took a few steps back and had Ling Xiao replace him, right in front of expert^1. He really didn't go easy on him since they were of the Guma Tribe.

source: 这时，游小默终于注意到万厨师和助手的存在，见他们直勾勾的盯着他做的菜，心中闪过一个主意。
en_us: That was when You XiaoMo noticed Chef Wan and his assistant . Seeing them staring directly at his food, he had an idea.

source: 这时，谈完话的男人和凌霄终于回来了，一进门就看到这幅画面，男人一脸惊讶，凌霄却若有所感的看向游小默，根据他的经验，造成这种情况绝对和他的夫人又千丝万缕的关系。
en_us: At this time, the man and Ling Xiao had finished their talk and were returning. Seeing this upon entering, the man looked shocked while Ling Xiao looked to You XiaoMo, having the feeling that it was was definitely his wife who had created such a scene.

source: 这时，迎面走过来几个人。
en_us: Several people walked directly towards him at this moment.

source: 这时，雅间的门二度被人推开。
en_us: That was when the door was opened once again.

source: 这时，青年突然灵光一闪，想到与他擦肩而过的银戈，急忙叫住正欲走进石林的银戈，“这位朋友，请等一等。”
en_us: At this moment, inspiration struck the youth as he recalled that he had brushed past Yin Ge. He hastily called out to Yin Ge, who was about to walk into the Stone Forest, "This friend here, may I request you to wait a moment?"

source: 这时，青年走出来，眼神不善的看了他一眼，旋即转头对真龙族的强者说道：“长老，之前我差点被水妖伤到其实是有人暗中给我下绊子，我怀疑是黑蜘蛛故意下的黑手，目的是想让我们全都死在水妖手里。”
en_us: It was then the young man walked out and looked maliciously at the Black Spider expert. Then he turned towards the True Dragon Clan and said, "Elder, I was almost hurt by the Water Demon before because someone had set a trap for me. I suspect that it was by the Black Spider's, they want us to all die under the hands of the Water Demons."

source: 这是个如花似玉的恬静美女，一双秋水般的眼睛盈盈生辉，小家碧玉的恬静气息给他一种熟悉的感觉。
en_us: This woman’s beauty was as delicate as a flower and as perfect as jade, eyes like autumn water shone, and the young lady’s refined composure gave him a feeling of familiarity.

source: 这是他第一次毫不犹豫的同意凌霄杀人的观点，可喜可贺！
en_us: This was the first time he unhesitatingly agreed with Ling Xiao's murderous suggestions! Amazing!

source: 这是准备当场办理手续？
en_us: Were they prepared to go through the procedures right here right now?

source: 这是吞金兽和乒乓球的心声。
en_us: Words said straight from the Metal Swallowing Beast and Ping Pang's heart.

source: 这是圣境强者的威压，只不过比凌霄要强大许多，除了苍盟的盟主，估计只有赤血家族的游震天。
en_us: This was the pressure from a Sacred Realm expert. Only that this person was much stronger than Ling Xiao. Other than the Head of the Cang Alliance, it could only be You ZhenTian from the Vermillion Blood Clan.

source: 这是已经没有其他势力想加入这场争夺，看游震天的架势似乎对这枚内丹志在必得，而且他们也不用担心会被游震天轻易拍到这枚内丹。
en_us: This had developed to the point where no other forces wanted to join in this fight. It seemed that You ZhenTian determined to win this Life Crystal based on his attitude, but they did not have to worry that You ZhenTian would be able to easily win this Life Crystal.(他们也不用担心会被游震天轻易拍到这枚内丹。)

source: 这是怕被他听到他们的秘密吗？
en_us: Was he afraid that he would overhear their secret?

source: 这是想出风头吗？
en_us: Did he want to show off?

source: 这是第一排的强者第一次参与竞拍。
en_us: It was the first time that a front row powerhouse participated in a bid.

source: 这是经由他手亦今最大的数目，虽然武成有些怀疑游小默能不能拿得出这么多灵晶，而且还是在拍卖盛会之前，要知道十神榜的强者也在邀请之列。
en_us: This was his biggest transaction ever, although Wu Cheng questioned if You XiaoMo had this much spirit gems to offer, especially before the aution. After all, the Top Ten (十神榜) were invited too.

source: 这是，独眼的手下廖牙突然冲出来，跑到独眼刀疤面前，看着他奄奄一息的模样，他愤怒的朝游小默吼道：“混蛋，你做了什么？”
en_us: That was when One-Eyed Scarface's underling ran out to One-Eyed Scarface and, seeing the other's state, yelled in rage at You XiaoMo, "What did you do?"

source: 这是，身后传来一阵脚步声。
en_us: That's when footsteps sounded behind him.

source: 这条碧妖蛇有两颗头，一颗头的眼睛是红色的，另一颗则是绿色的，看一眼就有种慎得慌的感觉，它就是碧妖蛇中的王者，上千万条才能出现一条，很少人知道，它的毒液才是通天大陆最厉害的毒，就算是麒麟神火一时半会也无法解决。
en_us: This Jade Devil Snake had two heads. The eyes of one head was red, while the eyes of the other was green. A sense of alarm seeped out from a glance at the snake. It was the king amongst the Jade Devil Snakes and only one would appear from every tens of millions. Few knew that its venom was the most powerful poison in the TongTian Continent and even the Qilin Godfire would be unable to neutralize the venom for a while.

source: 这枚戒指倒不是家主的信物之一，他只知道是那些老家伙们鼓励游君其的东西，据说里面装了不少灵晶。
en_us: It wasn't one of the authenticating object (keepsake/token) for being the head. All he knew was that it was a token of encourage from those old farts, supposedly it had a lot spirit gems.

source: 这株十二级灵草名为罗果草，在几片叶子中结着一颗红色的小果子，恰巧是他的存库中没有的灵草。
en_us: This magic herb was called 罗果草, small red fruits blooming between the leaves. It was coincidentally one of the herbs he did not possess.

source: 这样一想，大家的心情就忍不住激荡起来。
en_us: Once they thought of this, everyone could not help their emotions surging.

source: 这样人中，柴天却是最狡猾的。
en_us: Among these people, Chai Tian was the most cunning.

source: 这次交易实在是太合他的心意了。
en_us: This transaction was absolutely perfect.

source: 这次他知道很可能要栽了。
en_us: This time he knew it was probably over.

source: 这次失利，他主要败在轻敌，绝对不是实力不如凌霄。
en_us: The reason he suffered a defeat this time was mainly because he underestimated the enemy and definitely not because his strength was inferior to Ling Xiao.

source: 这次战绩没有人能想到，不过柴家和滕家确实是在混战中丢尽了脸，不出半天就在学院传遍了，现在人人都在猜测凌霄将会是此次大赛的第一名，一下子水涨船高，走到哪都会有人围观。
en_us: The results of this battle were unexpected, but the news of the Chai and Teng families being humiliated spread throughout the school within half a day. Now, everyone was guessing that Ling Xiao had to be first place in this time’s competition. He suddenly gained massive popularity, being stared at no matter where he went.

source: 这次斗篷人迅速的反应过来，一拳便朝某个方向毫不犹豫的砸过去，拳头的力量震得海水放佛从两边分开，其声势异常浩大。
en_us: This time, the cloaked man responded quickly and smashed a fist in a certain direction without the slightest hesitation. The strength of his fist was so shocking that it split the sea in half, and his momentum was extremely large (其声势异常浩大).

source: 这次晋级所花的时间比四级到五级的时候还要少，虽说丹师的等级是越高越难修炼，但是有老头的指点后，他的修炼速度就快了不少，现在，他炼丹已经不再像以前一样需要用双手，而是像老头用大炉鼎炼丹一样，只释放灵魂之力。
en_us: This breakthrough was achieved in even less time than the one from four to five; usually the higher one’s level, the harder cultivation becomes, but with the old geezer’s pointers, his cultivation speed saw much improvement. Now, he no longer need both hands to help with the refining process of pills, and instead, like how the old geezer used a cauldron to refine pills, he could do it through releasing his soul power.

source: 这次有点不一样，游君其完全是自愿的，儿子生气了，老子去面壁。
en_us: However, it was a little different this time. You JunQi's actions were completely voluntary. His son was angry, daddy had to face the wall.

source: 这次服食精血提升的修为，和激发龙族血脉并没有差别，他从三星提升到五星，虽然还不足以与游震天抗衡，但是也不至于完全没有把握。
en_us: His cultivation had risen from three stars to five stars. This time, there was no difference in the rise of his cultivation from taking the Blood Essence and stimulating the bloodline of the Dragon Clan. Although this increase was not enough to contend against You ZhenTian, it did not mean that the outcome of the battle would be certain.

source: 这次由小助手帮忙游小默把菜端到房间里，剩下万厨师在厨房看着，免得再像昨天一样，那他们就真的要哭死了。
en_us: This time, the little assistant helped You XiaoMo carry the food back to their room, leaving Chef Wan to look after the kitchen. If something like yesterday happened again, they were really going to cry themselves to sleep.

source: 这次的壮举着实吓了大家一跳。
en_us: This time, their magnificent feat truly gave everyone a scare.

source: 这次竟然会亲自出现在这里，可见他对白虎宫殿里的东西很重视，甚至有着志在必得的决心。
en_us: But for him to personally appear here now, it showed that he greatly valued what was inside the White Tiger's palace, and he was completely determined to win.

source: 这次说这句话的人不是游小默，而是凌霄。
en_us: The person who said this sentence was not You XiaoMo but Ling Xiao.

source: 这次进镇，他除了想打听黑莲草，还想再买些调料。
en_us: Apart from checking up on the black lotus herb, he also wanted buy some seasonings.

source: 这点面子还是要给的，而且财力也比拼不过他们。
en_us: After all, this amount of face should be given. Also, it's not like they could win in financial either.

source: 这番动静确实引来一些人，不过好在凌霄的速度太快，等他们赶到的时候已经人去楼空了。
en_us: This activity did attract some people, but fortunately Ling Xiao's speed was too fast. By the time they had arrived, there was not a single soul in the cave.

source: 这真是个不好的预感！
en_us: He had a really a bad premonition!

source: 这真是致命一击！
en_us: A critical hit!

source: 这种东西，游小默发誓他已经见过四次，抬起头看向凌霄，果然，凌霄漫不经心的表情变得严肃起来，精明的眼睛细细的眯起。
en_us: You XiaoMo swore that he already seen this sort of thing four times. He lifted his head up to look at Ling Xiao. Sure enough, Ling Xiao's indifferent expression slowly became solemn and his astute eyes delicately narrowed.

source: 这种事情对于东洲的部落来说是宁可信其有不可信其无，何况他们收到密报，水西部落曾经在暗地里遣派强者前往洞域，这种情况古玛部落补可能坐视不管。
en_us: The tribes of Dong Zhou would rather believe in it than not, further more, they received secret report that the ShuiXi Tribe (水西部落) had secretly sent experts to Dong Yu. In this case, the Guma tribe could not sit idly by.

source: 这种事情怎么看都是他吃亏，亏大了。
en_us: No matter how you thought about it, he was making a loss, a big one. (吃亏)

source: 这种女人是很恐怖的，她们招惹麻烦的本事就和她们对外貌的挑剔是成正比的，牛徐阳也算是自作自受，谁让他要喜欢上莫雪这种极品女人。
en_us: This kind of woman was very terrifying. Their ability to cause trouble was directly correlated to their nitpicking over looks. Niu XuYang could also be considered getting what he deserved. Who told him to like this sort of top-notch woman like Mo Xue.

source: 这种情况下是没有人敢胡乱哄抬价格的，连游震天也不会，除非是像游小默一样，身上没有家族负担之类的事情，而且敢不计代价，别人却以为他在哄抬价格。
en_us: Under such a situation no one dared to artificially raise the price, not even You ZhenTian. Unless they were like You XiaoMo who didn't have the burden of representing a clan and didn't care about the consequences, yet others thought he was messing around (而且敢不计代价，别人却以为他在哄抬价格).

source: 这种情况下，要么吞金兽他们已经逃了，要么他们还在没搜索的范围内，第一种喜闻乐见，第二种绝对菊花疼。
en_us: There were two scenarios under these circumstances. Either the Metal Swallowing Beast and Xiao Ping had already fled, or they were still within the searching range. The first scenario would be delightful to see and hear, the second would definitely cause his chrysanthemum to hurt.

source: 这种情况再打下去对他们没有好处。
en_us: There was no advantage for them to continue fighting in a situation like this.

source: 这种情况在下次晋级的时候会十分危险，这个叫玄泽的人到现在都没死，看来他的怨气不错。
en_us: Under these circumstances, it would be very dangerous for the practitioner when they advanced again. It seemed that the resentment of this man called Xuan Ze was pretty strong for him to not have died even until now. .

source: 这种情况在海域倒是很常见的事情，因为修炼者们也称为兽潮。
en_us: But this was something that happened quite often in the sea territory (海域), since practitioners also called this phenomenon the beast tide. (兽潮)

source: 这种情况恐怕就是那群自诩光明磊落的人都动心，何况是一直有着强盗之称的黑蜘蛛。
en_us: In this kind of scenario, even those that flaunted themselves as being open and candid would probably be tempted, let alone the Black Spider, who had always had that kind of bandit-like reputation.

source: 这种情况有点急切，毕竟每一个阶段都要有一段小小的适应期，而且他晋阶太快，晋级一品和二品的时候也比较急切，所以更需要适应期。
en_us: The situation was a bit rushed since after every level was an adjustment period. Also, he had been advancing way too fast, even from one star to two star it was the case. Thus, even more now, he needed this adjustment period.

source: 这种情形可想而知。
en_us: One could imagine what kind of situation that would be.

source: 这种情形在拍卖会其实是很常见的，特别是像黑蜘蛛这种不正规的黑市举办的拍卖会，因为他们并没有禁止恶意哄抬价格这种行为，所以谁跟谁有仇，看谁不顺眼都可以竞争，不管你身上有没有足够的灵晶，当然，如果拍下后没有灵晶付账，那么你要有被黑蜘蛛扒皮拆骨的心理准备。
en_us: This kind of thing was very common in auctions, especially the non-official ones of like the Black Spider auction. There was nothing preventing them from whooping up the price, thus if there was a grudge, or just not seeing eye to eye with someone, you could do it. However, if you got the item and couldn't pay, then you must be prepared to face the wrath of the Black Spider.

source: 这种想法一直都是强者们最原始的反应，到时把东西藏起来，就算你怀疑也不可能真去搜对方的身。
en_us: This was a primitive instinct of the strong. If they hid something, you couldn't go and search the other's body even if you suspected.

source: 这种方法比用双手炼丹要难很多，对灵魂之力的掌控要求也非常高，不过当熟练起来后，速度就会比用双手要快许多。
en_us: This method was much harder than using one’s own hands, and required finesse and control over one’s soul power, but once you became familiar with it, it would be much more efficient than refining pills with your hands.

source: 这种旁观他人上床的视角，游小默有种说不出的兴奋感，不过他绝对不是偷窥狂。
en_us: There was some sort of indescribable excitement to watching others from this perspective, but he definitely wasn't a voyeur.

source: 这种灭自己威风的事情当然不可能说出来。
en_us: He couldn't say something that would damage his image so.

source: 这种灵丹是他在天心派得到的丹方中翻出来的，服用一颗容颜丹可保持容颜不老百年，而且具有美容的效果，虽然不是长期的，但刚上市就受到女修炼者的热烈追捧。
en_us: These magic pills came from the recipes he gained from the TianXin sect; ingestion could reduce aging and had a cosmetic effect. Though they weren’t very long-lasting, they gained massive demand from female mages upon entering the market.

source: 这种灵丹的丹方向来比较少，游小默也是在玉简里找了几分钟才发现几张丹方，最后才选中心脉丹。
en_us: There had always been very few pill recipes for this kind of magic pill. You XiaoMo had searched in the jade drive for several minutes before he discovered a few pill recipes, selecting the Heart Vein Pill in the end.

source: 这种灵草便是传闻中的骷髅花草，之省长在环境恶劣的地方，比如古墓，或者瘴气之中。
en_us: This kind of magic herb was the legendary Skull Herb (骷髅花草). It typically grew in vile places, such as ancient tombs or amidst miasma.

source: 这种重力屋对修炼者和丹师都有相同作用，一进去就会感受到一股极大的重力。
en_us: The Gravity Room affected both practitioners and mages alike, as soon as they went in, it would be as in there was a huge weight on them.

source: 这缕灵魂之力带给两名守卫不小的压力。
en_us: This sliver of soul force gave the guards quite a bit of pressure.

source: 这群陌生人正是游小默他们。
en_us: This crowd of strangers was You XiaoMo and the rest.

source: 这般雷厉风行，以及一边倒的战况，霎时震撼了所有人。
en_us: This fierce offense and the one-sidedness of the battle shocked everyone to the core.

source: 这话一出，众人脸色各异。
en_us: When he said this, everyone's expressions twisted.

source: 这话姬凤到底有没有传达给姬宁禹知道，游小默是不知道，但是并不能改变他想揍姬宁禹的决心。
en_us: You XiaoMo didn't know whether or not Ji NingYu delivered this message to Ji Feng, but it didn't change his desire to smack Ji NingYu.

source: 这话已经暗示的很明显。
en_us: The hint in sentence was obvious.

source: 这话说的好像他们会有大麻烦一样。
en_us: He said it as if the two of them were going to encounter great difficulties.

source: 这货竟然比球队任何一个还要让他费心，首先他的修为在他的契约兽中是最低的，因为现在连皮球和猫球都已经有十阶五六星的修为，而且为了让他的金手指可以‘发扬光大’，他必须时常督促他，喂他吃灵丹，助他长修为。
en_us: This thing was actually more troublesome than any other member of the ball team. First of all, his level was the lowest, by now, even CatQiu and PiQiu were at level ten five/six stars. Also, for his commanding skill to work, he needs to push him to cultivate and feed him magic pills to help increase his level.

source: 这道气息并不是凌霄的，但是实力却跟凌霄一般无二，妥妥的十二阶强者，竟然这样就被他遇上了？
en_us: This scent (气息) wasn't Ling Xiao's but it's power was the same, definietly a Level Twelve expert. Just like that he met one?

source: 这道菜是他在早上过来时就已经事先吩咐万厨师腌制一只洗干净的鸭，用酒、精盐、白糖和花椒葱姜等东西腌制约两个小时。
en_us: This dish he already told Chef Wan to prepare beforehand when he came in the morning. For two hours a cleaned duck was marinated in wine, table salt, sugar, pepper, galic, ginger and etc.

source: 这里倒不是说中天也发生动乱，而是在其他地方形势严峻的时候，通天殿却决定把百年一次的选拔赛提前，记得上一次选拔赛是在四十年前，一下子提前六十年，确实让人感到意外。
en_us: This was not to say that there was also turmoil in Zhong Tian, but that the TongTian Palace decided to bring forward the selection contest held once every hundred years when the situations in other places were grim. The last selection contest was forty years ago. It was indeed surprising to hold the selection contest sixty years ahead of schedule.

source: 这里只有五个势力，分别是丹师工会，赤血家族，黑蜘蛛，真龙族和麒麟族。
en_us: There were only five major powers here: the Mage Association, the Vermillion Blood Clan, the Black Spider, the True Dragon Clan, and the Qilin Clan.

source: 这里可是东城，不是她的部落，她的身份也就只能吓唬一些胆小怕事的人。
en_us: This was 东城, (Dong Zhou?) not her tribe, her status would only scare the weaklings.

source: 这里的坟墓与外面的有明显的不同，最大的区别就是干净，不仅没有散落的骸骨，坟墓也是端端正正的排列成四排，而且相较于他们刚走过的地方，这里却显得安静许多，没有鬼哭狼嚎的声音，只有死一般的寂静。
en_us: The graves here were distinctly different from the ones outside. The biggest difference was that they were clean. Not only were there no scattered bones, the graves were also arranged neatly into four rows. Moreover, compared to the place that they had just walked through, this place was indeed much quieter and didn't have any noises like ghosts crying and howling. There was only a deathly quiet.

source: 这里除了凌霄就没有别人了，不得已的下下策。
en_us: There was no one else here except the for Ling Xiao so he had no choice but to resort to him.

source: 这里，所有人都没想到，在不久的将来，真的出现一个新人把两位老将挤下十神榜。
en_us: No one would've expected that, not long later, there really would be a newcomer who would kick both veterans out of the Ten Gods.

source: 这钟铁块名为九玄铁，传说是最适合用来打造地牢的东西，只有被九玄铁锁住的人，圣境之下绝无可能挣脱，而且还能起到禁锢强者修为的作用。
en_us: This legendary steel was called Nine Myth Steel. Legend had it that this was the material most suited for building prisons. For anyone lower than Sacred level, they had no chance of escape, and it also suppressed the power of whoever was captive.

source: 这附近还有其他人在，他们是来找右眼的，太多人知道反而不好，而且凌霄的伤势还没有彻底恢复，在不清楚底下那群人的实力前，他不想让凌霄冒险。
en_us: There was still other people around here searching for the right eye. It was better the less people knew about it and Ling Xiao's wounds haven't healed yet, so before he was sure of the strength of the people below, he wasn't going to take chances.

source: 进入桃源遗迹的时候，他分明没有看到凌霄二人，便料想到他们可能被夏音二人追杀到其他地方，未曾想到会在这里看到他，更没有想到出手帮助丹师工会他们的人会是他，一时不察便着了道。
en_us: When he had entered the Peach Blossom Ruins, he clearly hadn't seen Ling Xiao or You XiaoMo. He presumed that they had probably been chased by Xia Yin to some other place, and he hadn't expected to see him here. He even more so hadn't expected him to be the one who came out to help the Mage Association, and in a moment of oversight, he was fooled.

source: 进入楼阁，麟杭还未敲响，格内的声音就传了出来。
en_us: Entering the tower, Lin Hang hadn't even announced himself when a voice echoed out from inside.

source: 进入禁制后，凌霄没有立刻登上鬼哭涯，从白衣人和黑衣人的谈话中，天狗的成员似乎除了麟古没有一个欢迎他，这个时候就没必要大摇大摆的出现在他们面前。
en_us: After entering the restriction, Ling Xiao did not immediately ascend the Weeping Ghost Shore. From the conversation between the white and black robed men, none of the members of the Tengu, besides Gu Lin, welcomed him, so it was not necessary to strut about in front of them at this time.

source: 进去之前，守在门口的叶长老会先给每个人分发一枚传送石。
en_us: Before they went in, Elder Ye who stood at the door would give each person a transport stone

source: 进行到现在，拍卖会已经步入尾声，剩下的五分之一不说全是压轴物品，但绝对都是宝贝中的宝贝。
en_us: As things progressed this far, the auction was nearing the end with the about one-fifth of the items left. Even if they weren't all for the finale (压轴物品), they were all treasures amongst treasures.

source: 远古时期，东洲的形势和现在不同。
en_us: In ancient times, the situation(形势) in Dong Zhou was different from today.

source: 远古时期，很多丹师都会在东洲开垦灵草田，虽然现在已经不想远古那么盛行与盛产，但是古玛部落等势力到现在任然在大量种植灵草，这也是他们收入的重要来源之一。
en_us: In the ancient times, many mages would cultivate their magic herb fields in Dong Zhou. Although it wasn't as popular as before, the Guma Tribe still had massive lands for magic herbs, it was one of their main sources of income.
